{
    "basics": {
        "name": "Roger Qiu",
        "label": "Developer",
        "email": "roger.qiu@polyhack.io",
        "summary": "Software developer and designer focused on both front end architecture and infrastructure automation.",
        "website": "https://gist.github.com/CMCDragonkai",
        "location": {
            "address": "Sydney, Australia"
        },
        "profiles": [
            {
                "network": "Github",
                "username": "CMCDragonkai",
                "url": "https://github.com/CMCDragonkai"
            },
            {
                "network": "LinkedIn",
                "username": "qiuroger",
                "url": "https://www.linkedin.com/in/qiuroger"
            }
        ]
    },
    "work": [
        {
            "company": "Matrix AI",
            "position": "Founder",
            "website": "https://matrix.ai",
            "startDate": "2014-04-01",
            "summary": "Operating System for Distributed Infrastructure and Internet of Things",
            "highlights": [
                "Developing a compiler for a new language designed for type-safe distributed service composition. This involved research into type systems, compilers, distributed systems and operating system fundamentals.",
                "Contributor to the NixOS Linux distribution.",
                "Managing a team porting the IPFS content addressed store to Haskell and applying it to NixOS to improve package build reproducibility (https://github.com/MatrixAI/Forge-Package-Archiving, https://github.com/MatrixAI/haskell-multiaddr).",
                "Development of a privilege elevation demonstration involving C, Unix Domain Sockets, File Descriptor Passing, and Polkit infrastructure (https://github.com/MatrixAI/Privilege-Elevation).",
                "Development of a secret sharing system implementing OpenPGP and Git in JavaScript (https://github.com/MatrixAI/PolyKey).",
                "Developed an in-memory Unix filesystem supporting directories, files and symlinks using JavaScript (https://github.com/MatrixAI/js-virtualfs).",
                "Development of an in-memory Git in Javascript (https://github.com/MatrixAI/js-virtualgit).",
                "Development of a new lazy recursive perfectly balanced dynamically growing and shrinking bitmap tree data structure for sequentially allocatable and deallocatable resource counter in JavaScript (https://github.com/MatrixAI/js-resource-counter).",
                "Development of a Order Index Tree in JavaScript (https://github.com/MatrixAI/js-tree-order-index), and indexing data structure for trees for efficient queries and updates involving B+tree, immutability and concurrency, presented to a panel at the Sydney Papers Club.",
                "All JavaScript development done with Facebook Flow plus Babel ES6/ES7.",
                "Experiments involving many infrastructure tools including Emscripten, LUKS, ZFS, Packer, Git, Vagrant, Vault, Mesos, CoreOS, Docker, Ansible, Let's Encrypt, Scheduling, Network Namespaces, systemd, Unix security (DAC, Polkit, ACLs, MAC), AWS."
            ]
        },
        {

            "company": "ShelfTrend",
            "position": "Senior Developer",
            "website": "http://shelftrend.com",
            "startDate": "2017-07-01",
            "summary": "Development Backend Analytics Platform and Promotions Platform",
            "highlights": [
                "Custom promotions platform that involved development of a SQL finite state machine using triggers and event schedulers to track promotion code status, constraining usage by time, global use-count, per-user-use-count, and custom constraints implemented with Attribate Based Access Control (ABAC)."
            ]
        },
        {
            "company": "Holiday/Splend",
            "position": "Senior Lead Developer",
            "website": "https://madeby.holiday/work/splend",
            "startDate": "2017-01-25",
            "endDate": "2017-05-03",
            "summary": "React and Redux based Mobile Web Application for Splend Uber Drivers. The application tracked and visualised their earnings and performance. Drivers were able to report incidents on the application.",
            "highlights": [
                "Developed a batch processing system for millions of Uber driver transactions per year, this involved hacking MySQL into a queue processing system, and implementing a parallel map reduce in PHP, the result was a soft-realtime Uber earnings tracking system.",
                "OAuth 2.0 authentication integration into both Zoho CRM and Uber Driver API.",
                "Developed a custom PHP framework that integrated third party external services (Zoho CRM, Uber Driver API, Contentful CMS) and exposed these services as a REST API gateway for integration into the React frontend.",
                "Used async ReactPHP to parallelise requests to the Uber API for batch concurrent processing of payments.",
                "Used babel to program in ES2017 for JavaScript."
            ]
        },
        {
            "company": "Illuminate Imaging",
            "position": "CoFounder",
            "website": "https://illuminate.io",
            "startDate": "2015-09-01",
            "summary": "Image Processing Consulting Group with a Focus on the Resources Industry.",
            "highlights": [
                "Won first place in accuracy (second place in prize money) during the GoldFields sponsored Unearthed Ore-X Datascience Competition involving Gold Ore Quality Detection in Underground Tunnel Mining Photos. (http://portal.unearthed.solutions/2-gold-fields-aug-2015)",
                "Won the NASSCOM National Student Innovation Award in 2016. (https://nasscom.org.au/awards-2016/)",
                "Developed a Geomagnetic Survey Noise Detector using GDAL and combined it with artificial magnetic noise from OpenStreetMap for Frogtech (http://www.frogtech.com.au/)",
                "Developing data analysis pipeline using GIS tools (Geospatial Data Abstraction Library) and GIS databases.",
                "Experience in the Python data science toolkit including numpy, scikit, opencv."
            ]
        },
        {
            "company": "PhonicsHero",
            "position": "Software Developer Consultant",
            "website": "https://phonicshero.com",
            "startDate": "2014-10-01",
            "endDate": "2017-01-24",
            "summary": "Retainer agreement for developing frontend and backend features along with database maintenance",
            "highlights": [
                "Rewrote a legacy PHP payment system from Paypal to Braintree. This touched many areas in the backend and frontend.",
                "Restored server operations and database data from backups during a complete server failure.",
                "Developed an automatic database migration tool in Python involving millions of records from MySQL to MSSQL."
            ]
        },
        {
            "company": "Toyota East Timor",
            "position": "Software Developer Consultant",
            "website": "https://github.com/Polycademy/autotimorleste",
            "startDate": "2013-11-01",
            "endDate": "2015-02-22",
            "summary": "Developed Wordpress website for Toyota East Timor."
        },
        {
            "company": "SnapSearch",
            "position": "CoFounder",
            "website": "https://snapsearch.io",
            "startDate": "2013-09-01",
            "summary": "1. SEO for JavaScript, HTML5 and Single Page Applications 2. JavaScript Enhanced Data Scraping 3. Firefox as a Service",
            "highlights": [
                "Network namepacing the Firefox workers so that the network processing is handled in an isolated container from the rest of the server.",
                "Implemented a utility-tracking payment system that handled complex payment flows such as grace periods and integrated into Stripe. (https://gist.github.com/CMCDragonkai/da87036942f99f531510654b2cd9b19f)",
                "Automated Firefox workers with SlimerJS and CasperJS to intelligently scrape JavaScript enhanced websites in order to produce a snapshot so that simple spider bots can parse JavaScript enhanced content.",
                "Project managed and developed 4 client middleware in PHP, Ruby, Node.js and Python.",
                "Frontend of SnapSearch implemented in AngularJS and jQuery."
            ]
        },
        {
            "company": "Polycademy",
            "position": "Founder",
            "website": "http://polycademy.com",
            "startDate": "2012-11-01",
            "summary": "Setup an Physical School for Web Application Development and Entrepreneurship in Canberra. Developed course material involving Web Design, PHP and AngularJS. Taught 4 students over 3 months and one-on-one tutoring for another 3 months.",
            "highlights": [
                "First developer bootcamp in Australia.",
                "Got the first cohort of students to develop their application, and was able to have a demo day at the end showcasing an online chess game, parking finder application and more.",
                "Licensed Polycademy's course material to Code Master Institute in Perth (and they are still running with it!). (http://www.codemasterinstitute.com)",
                "Developed a Codeacademy-like application teaching PHP. (https://github.com/Polycademy/php_bounce)",
                "Used Codeception (http://codeception.com/) for Unit Tests and Integration Tests when developing an OAuth 2 authentication library.",
                "Started Code for Australia."
            ]
        }
    ],
    "volunteer": [
        {
            "organization": "AIESEC ANU",
            "position": "President",
            "website": "http://www.aiesecaustralia.org/",
            "startDate": "2011-12-01",
            "endDate": "2012-11-01",
            "summary": "President of AIESEC Australian National University, a student society focused on leadership development and international internships.",
            "highlights": [
                "Awarded 'Best Role Model of 2012'",
                "Organised the 'Initiate The Tour: Leadership & Convergence' conference. Acquired the ANU Vice Chancellor to speak at the event with roughly 80 participants.",
                "Developed the website for AIESEC ANU."
            ]
        }
    ],
    "education": [
        {
            "institution": "Australian National University",
            "area": "International Relations",
            "studyType": "Bachelor",
            "startDate": "2010-01-01",
            "endDate": "2013-12-01",
            "courses": [
                "Economics",
                "Sociology",
                "Environmental Science",
                "Classical Chinese"
            ]
        }
    ],
    "publications": [
        {
            "name": "Building a Physical Analogue for Feedback Rich Systems",
            "releaseDate": "2016-11-13",
            "website": "https://github.com/MatrixAI/Inertial-Orbit-Detection",
            "summary": "Co-developed the controller, game and server software for a systems engineering thesis at the Australian National University. This involved processing code for a flappy bird clone, C for the arduino rotational sensor, and Python for rotation processing server which handles serial input from the controller, sampling a rolling window of inertial sensor data, signal processing the raw data into a sine wave, and frequency estimation via numpy and scipy. It finally plots the data and sends the data to the game as input."
        },
        {
            "name": "History Data Structures",
            "releaseDate": "2016-06-15",
            "website": "https://gist.github.com/CMCDragonkai/d266a3055735545447439f0fa662a0e1",
            "summary": "A discussion about data structures supporting history traversal."
        },
        {
            "name": "Indexing Highly Dynamic Hierarchal Data",
            "releaseDate": "2015",
            "website": "https://www.meetup.com/Sydney-Paper-Club/events/245454416/?eventId=245454416",
            "summary": "Implemented data structure in JavaScript (https://github.com/MatrixAI/js-tree-order-index) and presented implementation to the Sydney Papers Club."
        }
    ],
    "skills": [
        {
            "name": "Software Development",
            "keywords": [
                "PHP (https://gist.github.com/search?l=PHP&q=user%3ACMCDragonkai)",
                "SQL - MySQL & PostgresSQL (https://gist.github.com/search?l=SQL&q=user%3ACMCDragonkai)",
                "Haskell (https://gist.github.com/search?l=Haskell&q=user%3ACMCDragonkai)",
                "Elixir (https://gist.github.com/search?l=Elixir&q=user%3ACMCDragonkai)",
                "Python (https://gist.github.com/search?l=Python&q=user%3ACMCDragonkai)",
                "Javascript (https://gist.github.com/search?l=JS&q=user%3ACMCDragonkai)",
                "Twelf (https://gist.github.com/search?q=user%3ACMCDragonkai+Twelf&ref=searchresults)",
                "Bash (https://gist.github.com/search?l=Shell&q=user%3ACMCDragonkai)",
                "C (https://gist.github.com/search?l=C&q=user%3ACMCDragonkai)",
                "C++ (https://gist.github.com/search?l=C%2B%2B&q=user%3ACMCDragonkai)",
                "Git (https://gist.github.com/search?q=user%3ACMCDragonkai+git&ref=searchresults)",
                "PowerShell (https://github.com/CMCDragonkai/.dotfiles)",
                "x86 Assembly (https://github.com/CMCDragonkai/assembly)"
            ]
        },
        {
            "name": "Software Design",
            "keywords": [
                "Photoshop"
            ]
        },
        {
            "name": "Business Management",
            "keywords": [
                "Completed Australian R&D Tax Incentive applications 4 times for my projects and startups.",
                "Managing a team of 4 software engineers in Matrix AI."
            ]
        }
    ],
    "languages": [
        {
            "language": "English",
            "fluency": "Native speaker"
        },
        {
            "language": "Chinese",
            "fluency": "Working proficiency"
        }
    ]
}
